sifive/cinco/hardware/freedom_e/boards.txt
menu.pgm_loc=Program Location

freedom_e300_arty_devkit.name=Freedom E300 Arty DevKit
freedom_e300_arty_devkit.build.f_cpu=65000000L
#Point to the file for ./variants/<variant>/pins_arduino.h
freedom_e300_arty_devkit.build.variant=standard
freedom_e300_arty_devkit.build.mcu=rv32imaf
#"The 'core' file directory for this board, in ./cores
freedom_e300_arty_devkit.build.core=arduino
# This sets a define for use in the compiled code.
freedom_e300_arty_devkit.build.board=FREEDOM_E300_ARTY_DEVKIT
freedom_e300_arty_devkit.build.sdata.size=4096
#This selects the tool from "programmers.txt"
freedom_e300_arty_devkit.program.tool=openocd
freedom_e300_arty_devkit.upload.tool=openocd
freedom_e300_arty_devkit.menu.pgm_loc.flash=Flash
freedom_e300_arty_devkit.menu.pgm_loc.ram=Scratchpad
# Limit is the 128MB Flash. Assume half is used for something else.
freedom_e300_arty_devkit.menu.pgm_loc.flash.upload.maximum_size=67108864
freedom_e300_arty_devkit.menu.pgm_loc.flash.crt=crt0f
freedom_e300_arty_devkit.menu.pgm_loc.flash.build.ldscript={build.system.path}/riscv/lib/ldscripts/freedom-e300-flash.ld

# Limit is the 16kB Scratchpad, less stack and other regions.
freedom_e300_arty_devkit.menu.pgm_loc.ram.upload.maximum_size=15360
freedom_e300_arty_devkit.menu.pgm_loc.ram.crt=crt0
freedom_e300_arty_devkit.menu.pgm_loc.ram.build.ldscript={build.system.path}/riscv/lib/ldscripts/freedom-e300-sram.ld

#TODO:
#Write a new board for hifive
